support.org
*** hydra-org
 #+begin_src emacs-lisp
   (:hydra episteme-hydra-org (:color red :major-mode org-mode)
     ("Shift"
      (("K" org-move-subtree-up "up")
       ("J" org-move-subtree-down "down")
       ("h" org-promote-subtree "promote")
       ("l" org-demote-subtree "demote"))
      "Travel"
      (("p" org-backward-heading-same-level "backward")
       ("n" org-forward-heading-same-level "forward")
       ("j" hydra-org-child-level "to child")
       ("k" hydra-org-parent-level "to parent")
       ("a" hydra-org-goto-first-sibling "first sibling")
       ("e" hydra-org-goto-last-sibling "last sibling"))
      "Perform"
      (("t" (org-babel-tangle) "tangle" :color blue)
       ("e" (org-html-export-to-html) "export" :color blue)
       ("b" helm-org-in-buffer-headings "browse")
       ("r" (lambda () (interactive)
              (helm-org-rifle-current-buffer)
              (org-cycle)
              (org-cycle)) "rifle")
       ("w" helm-org-walk "walk")
       ("v" avy-org-goto-heading-timer "avy")
       ("L" org-toggle-link-display "toggle links"))))
#+end_src

* startup
#+begin_src emacs-lisp
  (call-interactively 'episteme:dashboard)
#+end_src
